Tekla Open API Reference for Tekla Structures 2025
GridLabel Methods
The GridLine.GridLabel type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 The bounding box of the grid line label (rectangle format, axis aligned).
GetAxisAlignedBoundingBoxOfTextLabel
 The bounding box of the grid line label's text (rectangle format, axis aligned).
MoveObjectRelative
 Moves the object using the move vector.
Top
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace